{"Si": 0, "C": 1, "Pb": 2, "I": 3, "Br": 4, "Cl": 5, "Eu": 6, "O": 7, "Fe": 8, "Sb": 9, "In": 10, "S": 11, "N": 12, "U": 13, "Mn": 14, "Lu": 15, "Se": 16, "Tl": 17, "Hf": 18, "Ir": 19, "Ca": 20, "Ta": 21, "Cr": 22, "K": 23, "Pm": 24, "Mg": 25, "Zn": 26, "Cu": 27, "Sn": 28, "Ti": 29, "B": 30, "W": 31, "P": 32, "H": 33, "Pd": 34, "As": 35, "Co": 36, "Np": 37, "Tc": 38, "Hg": 39, "Pu": 40, "Al": 41, "Tm": 42, "Tb": 43, "Ho": 44, "Nb": 45, "Ge": 46, "Zr": 47, "Cd": 48, "V": 49, "Sr": 50, "Ni": 51, "Rh": 52, "Th": 53, "Na": 54, "Ru": 55, "La": 56, "Re": 57, "Y": 58, "Er": 59, "Ce": 60, "Pt": 61, "Ga": 62, "Li": 63, "Cs": 64, "F": 65, "Ba": 66, "Te": 67, "Mo": 68, "Gd": 69, "Pr": 70, "Bi": 71, "Sc": 72, "Ag": 73, "Rb": 74, "Dy": 75, "Yb": 76, "Nd": 77, "Au": 78, "Os": 79, "Pa": 80, "Sm": 81, "Be": 82, "Ac": 83, "Xe": 84, "Kr": 85, "He": 86, "Ne": 87, "Ar": 88, "0": 89, "1": 90, "2": 91, "3": 92, "4": 93, "5": 94, "6": 95, "7": 96, "8": 97, "9": 98, "_cell_length_b": 99, "_atom_site_occupancy": 100, "_atom_site_attached_hydrogens": 101, "_cell_length_a": 102, "_cell_angle_beta": 103, "_symmetry_equiv_pos_as_xyz": 104, "_cell_angle_gamma": 105, "_atom_site_fract_x": 106, "_symmetry_space_group_name_H-M": 107, "_symmetry_Int_Tables_number": 108, "_chemical_formula_structural": 109, "_chemical_name_systematic": 110, "_atom_site_fract_y": 111, "_atom_site_symmetry_multiplicity": 112, "_chemical_formula_sum": 113, "_atom_site_label": 114, "_atom_site_type_symbol": 115, "_cell_length_c": 116, "_atom_site_B_iso_or_equiv": 117, "_symmetry_equiv_pos_site_id": 118, "_cell_volume": 119, "_atom_site_fract_z": 120, "_cell_angle_alpha": 121, "_cell_formula_units_Z": 122, "loop_": 123, "data_": 124, "_atom_type_symbol": 125, "_atom_type_electronegativity": 126, "_atom_type_radius": 127, "_atom_type_ionic_radius": 128, "_atom_type_oxidation_number": 129, "x": 130, "y": 131, "z": 132, ".": 133, "(": 134, ")": 135, "+": 136, "-": 137, "/": 138, "'": 139, ",": 140, " ": 141, "\n": 142, "P6/mmm_sg": 143, "Imma_sg": 144, "P4_32_12_sg": 145, "P4_2/mnm_sg": 146, "Fd-3m_sg": 147, "P3m1_sg": 148, "P-3_sg": 149, "P4mm_sg": 150, "P4_332_sg": 151, "P4/nnc_sg": 152, "P2_12_12_sg": 153, "Pnn2_sg": 154, "Pbcn_sg": 155, "P4_2/n_sg": 156, "Cm_sg": 157, "R3m_sg": 158, "Cmce_sg": 159, "Aea2_sg": 160, "P-42_1m_sg": 161, "P-42m_sg": 162, "P2_13_sg": 163, "R-3_sg": 164, "Fm-3_sg": 165, "Cmm2_sg": 166, "Pn-3n_sg": 167, "P6/mcc_sg": 168, "P-6m2_sg": 169, "P3_2_sg": 170, "P-3m1_sg": 171, "P3_212_sg": 172, "I23_sg": 173, "P-62m_sg": 174, "P4_2nm_sg": 175, "Pma2_sg": 176, "Pmma_sg": 177, "I-42m_sg": 178, "P-31c_sg": 179, "Pa-3_sg": 180, "Pmmn_sg": 181, "Pmmm_sg": 182, "P4_2/ncm_sg": 183, "I4/mcm_sg": 184, "I-4m2_sg": 185, "P3_1_sg": 186, "Pcc2_sg": 187, "Cmcm_sg": 188, "I222_sg": 189, "Fddd_sg": 190, "P312_sg": 191, "Cccm_sg": 192, "P6_1_sg": 193, "F-43c_sg": 194, "P6_322_sg": 195, "Pm-3_sg": 196, "P3_121_sg": 197, "P6_4_sg": 198, "Ia-3d_sg": 199, "Pm-3m_sg": 200, "P2_1/c_sg": 201, "C222_1_sg": 202, "Pc_sg": 203, "P4/n_sg": 204, "Pba2_sg": 205, "Ama2_sg": 206, "Pbcm_sg": 207, "P31m_sg": 208, "Pcca_sg": 209, "P222_sg": 210, "P-43n_sg": 211, "Pccm_sg": 212, "P6_422_sg": 213, "F23_sg": 214, "P42_12_sg": 215, "C222_sg": 216, "Pnnn_sg": 217, "P6_3cm_sg": 218, "P4_12_12_sg": 219, "P6/m_sg": 220, "Fmm2_sg": 221, "I4_1/a_sg": 222, "P4/mbm_sg": 223, "Pmn2_1_sg": 224, "P4_2bc_sg": 225, "P4_22_12_sg": 226, "I-43d_sg": 227, "I4/m_sg": 228, "P4bm_sg": 229, "Fdd2_sg": 230, "P3_sg": 231, "P6_122_sg": 232, "Pnc2_sg": 233, "P4_2/mcm_sg": 234, "P4_122_sg": 235, "Cmc2_1_sg": 236, "P-6c2_sg": 237, "R32_sg": 238, "P4_1_sg": 239, "P4_232_sg": 240, "Pnna_sg": 241, "P422_sg": 242, "Pban_sg": 243, "Cc_sg": 244, "I4_122_sg": 245, "P6_3/m_sg": 246, "P6_3mc_sg": 247, "I4_1/amd_sg": 248, "P4_2_sg": 249, "P4/nmm_sg": 250, "Pmna_sg": 251, "P4/m_sg": 252, "Fm-3m_sg": 253, "P4/mmm_sg": 254, "Imm2_sg": 255, "P4/ncc_sg": 256, "P-62c_sg": 257, "Ima2_sg": 258, "P6_5_sg": 259, "P2/c_sg": 260, "P4/nbm_sg": 261, "Ibam_sg": 262, "P6_522_sg": 263, "P6_3/mmc_sg": 264, "I4/mmm_sg": 265, "Fmmm_sg": 266, "P2/m_sg": 267, "P-4b2_sg": 268, "I-4_sg": 269, "C2/m_sg": 270, "P4_2/mmc_sg": 271, "P4_sg": 272, "Fd-3c_sg": 273, "P4_3_sg": 274, "P2_1/m_sg": 275, "I-43m_sg": 276, "P-42c_sg": 277, "F4_132_sg": 278, "Pm_sg": 279, "Pccn_sg": 280, "P-4n2_sg": 281, "P4_132_sg": 282, "P23_sg": 283, "I4cm_sg": 284, "R3c_sg": 285, "Amm2_sg": 286, "Immm_sg": 287, "Iba2_sg": 288, "I4_sg": 289, "Fd-3_sg": 290, "P1_sg": 291, "Pbam_sg": 292, "P4_2/nbc_sg": 293, "Im-3_sg": 294, "P4_2/nnm_sg": 295, "Pmc2_1_sg": 296, "P-31m_sg": 297, "R-3m_sg": 298, "Ia-3_sg": 299, "P622_sg": 300, "F222_sg": 301, "P2_sg": 302, "P-1_sg": 303, "Pmm2_sg": 304, "P-4_sg": 305, "Aem2_sg": 306, "P6_222_sg": 307, "P-3c1_sg": 308, "P4_322_sg": 309, "I422_sg": 310, "Pnma_sg": 311, "P6_3_sg": 312, "P3c1_sg": 313, "Pn-3_sg": 314, "P4nc_sg": 315, "P-6_sg": 316, "P4/mcc_sg": 317, "I2_12_12_1_sg": 318, "P4_2/mbc_sg": 319, "P31c_sg": 320, "Ccc2_sg": 321, "P4_2/nmc_sg": 322, "P6_3/mcm_sg": 323, "C2_sg": 324, "Pbca_sg": 325, "P-4c2_sg": 326, "I4_1cd_sg": 327, "P2_1_sg": 328, "P3_112_sg": 329, "P4_2mc_sg": 330, "Pn-3m_sg": 331, "C2/c_sg": 332, "R3_sg": 333, "P-43m_sg": 334, "I432_sg": 335, "P222_1_sg": 336, "I-42d_sg": 337, "I-4c2_sg": 338, "P6cc_sg": 339, "P6_2_sg": 340, "P3_221_sg": 341, "P321_sg": 342, "Pca2_1_sg": 343, "I4_1/acd_sg": 344, "I4_132_sg": 345, "F432_sg": 346, "Pna2_1_sg": 347, "Ccce_sg": 348, "Ibca_sg": 349, "P4/mnc_sg": 350, "I4_1md_sg": 351, "P2_12_12_1_sg": 352, "R-3c_sg": 353, "I2_13_sg": 354, "P-4m2_sg": 355, "Pm-3n_sg": 356, "I4mm_sg": 357, "F-43m_sg": 358, "Pnnm_sg": 359, "P-42_1c_sg": 360, "Cmmm_sg": 361, "P6mm_sg": 362, "P4_2cm_sg": 363, "P4_2/m_sg": 364, "Im-3m_sg": 365, "Fm-3c_sg": 366, "I4_1_sg": 367, "P4cc_sg": 368, "Cmme_sg": 369, "<unk>": 370, "<pad>": 371, "<bos>": 372, "<eos>": 373, "[": 374, "]": 375, "<prop>": 376}